Revit 2018 API
ApplicationEntryPoint Properties
The ApplicationEntryPoint type exposes the following members.
Properties
Name | Description
ActiveAddInId
 Get current active external application or external command id.
 (Inherited from UIApplication.)
ActiveUIDocument
Provides access to an object that represents the currently active project.
 (Inherited from UIApplication.)
AddinFolder
 The full path to the Revit Macros module.
Application
 Returns the database level Application represented by this UI level Application.
 (Inherited from UIApplication.)
DrawingAreaExtents
Get the rectangle that represents the screen pixel coordinates of drawing area.
 (Inherited from UIApplication.)
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
 (Inherited from UIApplication.)
LoadedApplications
 Returns an array of successfully loaded external applications.
 (Inherited from UIApplication.)
MainWindowExtents
Get the rectangle that represents the screen pixel coordinates of Revit main window.
 (Inherited from UIApplication.)
See Also
ApplicationEntryPoint Class
Autodesk.Revit.UI.Macros Namespace